aeroHPC/OpenFOAM/test/chemistry/air11/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// 1. Use the generic solver runner
application     foamRun;

// 2. Tell foamRun which solver logic to use (defined in your library)
solver          shockThermo;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         7e-03;

deltaT          1e-03;

maxDeltaT       1;

adjustTimeStep  off;

writeControl    timeStep;
//writeControl	timeStep;
//writeInterval	1;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;


functions
{
    probes1
    {
        type            probes;
        libs            ( "libsampling.so" );
        writeControl    timeStep;
        writeInterval   1;

        fields          ( T Tve Et Ev p e );

        // choose probe point(s) inside the mesh (edit coordinates!)
        probeLocations
        (
            (0 0 0)
        );
    }
}


libs
(
    // Standard Thermo (Safety)
    "libfluidThermophysicalModels.so"
     "libmutationMixture.so"
    "libhighEnthalpyThermophysicalModels.so"
"libcombustionModels.so"
    // Your Solver
    "libshockThermo.so"
);


DebugSwitches
{
    SolverPerformance   0;
}

// ************************************************************************* //
