aeroHPC/OpenFOAM/test/chemistry/air11/constant/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
T	20000;
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      initialConditions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constantProperty pressure;
constantProperty pressure;

 p           101325;  // Pa (1 atm)
 T           12000;   // K
fractionBasis  mole;
fractionBasis  mole;


fractions
{
    N2      0.79;
    O2      0.21;
    NO      0;
    N       0;
    O       0;
}




// ************************************************************************* //
