aeroHPC/OpenFOAM/test/chemistry/air11/constant/reactions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*\
References:
    1) Park et al., JTHT 15(1):76-90, 2001.
    2) Park, JTHT 7(3):385-398, 1993.

Air 11-species: e- N+ O+ NO+ N2+ O2+ N O NO N2 O2
\*---------------------------------------------------------------------------*/
reactions
{
    // ---------------------------------------------------------------------
    // 1) N2 dissociation: N2 (+M) -> N + N (+M)
    // Park-type / Arrhenius
    // ---------------------------------------------------------------------
    reaction-1
    {
        type            reversibleThirdBodyArrhenius;
        reaction        "N2 = N + N";
        A               7.0e+18;
        beta            -1.6;
        Ta              113200;
        coeffs
        (
            (O2 1)
            (O  4.285714286)
            (N  4.285714286)
            (N2 1)
            (NO 1)
        );
        isDissociative yes;
    }

    // ---------------------------------------------------------------------
    // 2) O2 dissociation: O2 (+M) -> O + O (+M)
    // ---------------------------------------------------------------------
    reaction-2
    {
        type            reversibleThirdBodyArrhenius;
        reaction        "O2 = O + O";
        A               2.0e+18;
        beta            -1.5;
        Ta              59360;
        coeffs
        (
            (O2 1)
            (O  5)
            (N  5)
            (N2 1)
            (NO 1)
        );
        isDissociative yes;
    }

    // ---------------------------------------------------------------------
    // 3) NO exchange: NO + O <-> N + O2
    // ---------------------------------------------------------------------
    reaction-3
    {
        type            reversibleArrhenius;
        reaction        "NO + O = N + O2";
        A               8.4e+9;
        beta            0.0;
        Ta              19400;
    }

    // ---------------------------------------------------------------------
    // (Optional) NO dissociation: NO -> N + O
    // Usually omitted in air-5 sets, but allowed:
    // ---------------------------------------------------------------------
    // reaction-4
    // {
    //     type            reversibleArrhenius;
    //     reaction        "NO = N + O";
    //     A               5.0e+12;
    //     beta            0.0;
    //     Ta              75500;
    // }
}

// ************************************************************************* //
