aeroHPC/OpenFOAM/test/chemistry/air11/constant/speciesThermo
/*---------------------------------------------------------------------------*\
Reference:
    Cantera format NASA9 files from Caltech Explosion Dynamics Laboratory
    https://shepherd.caltech.edu/EDL/PublicResources/sdt/cti_mech.html (checked on 05/10/2024)

    Thermodynamics:     Caltech NASA9 converted from cantera: thermo.airNASA9ions
                        NASA Glenn Coefficients for Calculating Thermodynamic Properties of  Individual Species (NASA9)
                        https://ntrs.nasa.gov/api/citations/20020085330/downloads/20020085330.pdf (checked on 30/09/2024)
                        
                        Cantera format NASA9 coefficients files from Caltech Explosion Dynamics Laboratory
                        https://shepherd.caltech.edu/EDL/PublicResources/sdt/cti_mech.html (checked on 05/10/2024)

    Transport:          OpenFOAM-12 tutorials
                        hyperFoam


Air 25-species: O2 O N2 N NO C C2 CO CO2 CN AR HE e- N+ NO+ N2+ O+ O2+ AR+ CO2+ CO+ HE+ C+ C2+ CN+
\*---------------------------------------------------------------------------*/

species 5 ( N2 O2 NO N O );

N2
{
    specie
    {
        molWeight       28.0134;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           20000;
        Tcommon         10100;
        highCpCoeffs    ( 38.55815934 -0.0108273068 1.226284434e-06 -5.638174308e-11 9.111977686e-16 -85568.88752 -253.8974967 );
        lowCpCoeffs     ( 3.233832905 0.0008859052376 -2.174073977e-07 2.203149561e-11 -6.776238159e-16 -1008.567335 4.338787749 );
    }
    transport
    {
        As              1.907238654e-06;
        Ts              403.2298446;
        Amu             0.0203;
        Bmu             0.4329;
        Cmu             -11.8153;
        Ak              0.03607;
        Bk              -1.07503;
        Ck              11.95029;
        Dk              -57.90063;
        Ek              93.21782;
    }
    elements
    {
        N               2;
    }
}

O2
{
    specie
    {
        molWeight       31.9988;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           20000;
        Tcommon         10100;
        highCpCoeffs    ( 3.427649383 0.0009238394608 -1.259569615e-07 5.866978662e-12 -9.445550182e-17 -3256.487032 4.176094987 );
        lowCpCoeffs     ( 3.425479625 0.0008259646106 -1.639112071e-07 1.77042095e-11 -8.05979015e-16 -1045.364323 4.905191907 );
    }
    transport
    {
        As              2.206126191e-06;
        Ts              408.5263796;
        Amu             0.0484;
        Bmu             -0.1455;
        Cmu             -8.9231;
        Ak              0.07987;
        Bk              -2.58428;
        Ck              31.25959;
        Dk              -166.76267;
        Ek              321.69820;
    }
    elements
    {
        O               2;
    }
}

NO
{
    specie
    {
        molWeight       30.0061;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           20000;
        Tcommon         10100;
        highCpCoeffs    ( -2.35248137 0.001355584385 -5.181297277e-08 -9.337636405e-13 5.229058611e-17 31154.78728 51.34514341 );
        lowCpCoeffs     ( 3.346688333 0.0009404198431 -2.671831308e-07 3.27057029e-11 -1.3136469e-15 9933.226018 5.97581086 );
    }
    transport
    {
        As              1.97390799e-06;
        Ts              403.2298469;
        Amu             0.0452;
        Bmu             -0.0609;
        Cmu             -9.4596;
        Ak              0.02792;
        Bk              -0.87133;
        Ck              10.17967;
        Dk              -52.03466;
        Ek              88.67060;
    }
    elements
    {
        N               1;
        O               1;
    }
}

N
{
    specie
    {
        molWeight       14.0067;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           20000;
        Tcommon         10100;
        highCpCoeffs    ( 0.9495603198 0.0007315331526 -7.224723373e-08 3.113726926e-12 -4.921021893e-17 56822.56013 14.47300668 );
        lowCpCoeffs     ( 2.547219978 -6.947660269e-05 8.363928095e-09 5.761462021e-12 -4.834285606e-16 56096.895 3.94075531 );
    }
    transport
    {
        As              1.696593553e-06;
        Ts              390.6888192;
        Amu             0.0120;
        Bmu             0.5930;
        Cmu             -12.3805;
        Ak              0;
        Bk              0;
        Ck              0.01619;
        Dk              0.55022;
        Ek              -12.92190;
    }
    elements
    {
        N               1;
    }
}

O
{
    specie
    {
        molWeight       15.9994;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           20000;
        Tcommon         10100;
        highCpCoeffs    ( 3.388741947 -0.0001579957511 1.337102872e-08 -3.94138872e-13 3.423751133e-18 26012.37678 -1.763654729 );
        lowCpCoeffs     ( 2.649392641 -0.0001714886617 5.915981397e-08 -6.297113916e-12 2.23273121e-16 29177.93129 4.309900751 );
    }
    transport
    {
        As              2.567509404e-06;
        Ts              394.5719957;
        Amu             0.0205;
        Bmu             0.4257;
        Cmu             -11.5803;
        Ak              0;
        Bk              0;
        Ck              0.03310;
        Dk              0.22834;
        Ek              -11.58116;
    }
    elements
    {
        O               1;
    }
}

